from discord import Embed


welcome_embed = Embed(title="به نظر کاربر جدید هستی :thinking:",
description="""**سلام کاربر عزیز ، به سیستم تبلیغاتی ما خوش اومدی!
اینجا میتونی به صورت کاملا رایگان هر بنر تبلیغاتی رو به راحتی تبلیغ کنی 👍🏼
با استفاده از خدمات ما میتونی سرور دیسکورد ، صفحات اجتماعی ، محصولات ، فروشگاهتو به راحتی تبلیغ کنی و ویو ، ممبر ، مشتری و... جذب کنی !😎
\n**""",color=Colour.gold())
welcome_embed.set_footer(text="ثبت نام شما با موفقیت انجام شد ✅")
welcome_embed.add_field(name=" 🔰 از کجا شروع کنم؟",value="""برای اطلاعات بیشتر در مورد خدمات تبلیغاتی ما و آموزش کارکردن با بات از دستور `help/` استفاده کنید """)




get_started_embed = Embed(title="آموزش کار با بات و ثبت بنر تبلیغاتی 📚",description="""
                              
                              
                              > ** برای ثبت بنر به چی نیاز دارم ؟ ❓**

                              خب اول از همه بگم برای ثبت بنر تبلیغاتی شما نیاز به سکه دارید!
                              اما چند تا ؟ شما نیاز به 500 سکه دارید.
                              در ابتدای شروع کار ما به شما 500 سکه هدیه میدیم 🎁

                              ----------------------------------------------------------------------------------

                              > ** چجوری سکه بگیرم؟ ❓**

                               برای به دست آوردن سکه شما میتوانید بنر های تبلیغاتی دیگران رو ببینید و از دکمه Claim زیر بنر هاشون استفاده کنید تا سکه بگیرید
                              با هر بار کلیک کردن روی دکمه Claim زیر بنر ها شما 10 سکه دریافت میکنید!

                              ----------------------------------------------------------------------------------

                              > ** از کجا بفهمم چند تاسکه دارم؟ ❓**

                              میتونید مقدار سکه هاتون رو با دستور `account_info/` مشاهده کنید.

                              ----------------------------------------------------------------------------------

                              > **چجوری بنرمو ثبت کنم؟ ❓**

                              خب اگر سکه هاتون کافی بود میتونید با استفاده از دستور `order/` بنر تبلیغاتیتون رو ثبت کنید.
                              به محض استفاده از این دستور پیامی مبنی بر قوانین ثبت بنر میبینید ، اون رو مطالعه کنید و روی دکمه میپذیرم کلیک کنید.
                              حالا یک صفحه فرم براتون باز میشه که میتونید توش بنر تبلیغاتیتون رو تایپ کپی پیست کنید.
                              فقط حواستون باشه که نمیتونید بیش از 4000 کاراکتر وارد کنید!
                              و حالا روی دکمه Submit کلیک کیند و بوم ...
                              بنر شما با موفقیت ثبت شد 😁 به همین سادگی 👌

                              ----------------------------------------------------------------------------------

                              > **داستان ریپورت چیه؟ ❓**

                              اگر شما قوانین ثبت بنر رو رعایت نکنید و کاربری بنر شما رو گزارش بده شما اخطار دریافت میکنید و بنرتون پاک میشه!
                              اگر این اخطار ها به 3 بار برسه متاسفانه شما برای همیشه از سرور بن میشید و نمیتونید دیگه از این خدمات استفاده کنید
                              راستی شما هم اگر بنر غیرمجازی رو دیدید میتونید گزارشش بدید ، گزارش ارسالی شما توسط تیم دیسکواد بررسی میشه و در صورت صحت گزارش 200 سکه به شما هدیه داده میشه 🤑
                              برای گزارش دادن هم کافیه از دکمه Report زیر بنر استفاده کنید.

                              ----------------------------------------------------------------------------------

                              > **میتونم سکه بخرم؟ ❓**

                              بله اگر حوصله مشاهده سایر بنر های تبلیغاتی رو ندارید میتونید مستقیما سکه بخرید و بنرتون رو ثبت کنید😊

                              ----------------------------------------------------------------------------------

                              > **محتوای بنرم چی میتونه باشه؟ ❓**

                              محتوای بنرتون میتونه شامل لینک اینوایت سرور دیسکورد ، تبلیغ یک سایت یا محصول ، ویدیوی یوتوب ، مدیا ، متن خالی و هر چیزی میتونه باشه.
                              البته در رابطه با لینک و مدیا یه سری قوانین هست که باید رعایت شه: مثلا لینک نباید لینک سایت های پورن و سایت های ممنوعه باشه و مدیا نباید حاوی محتوای جنسی یا ناجور باشه!

                              ----------------------------------------------------------------------------------

                              > **بنرم تا چه مدت باقی میمونه؟ ❓**

                              بنر شما در چنل <#1224577122555920405> 24 ساعت معادل یک شبانه روز کامل باقی میمونه و به صورت عمومی قابل مشاهده است.
                              بعد از این مدت بنر به صورت خودکار پاک میشه ♻ 

                            > ** لیست دستورات بات :**
""",color=Colour.blurple())
get_started_embed.add_field(name="`/account_info`",value="**نمایش اطلاعات کاربری شما در سیستم بات و دیتابیس**",inline=False)
get_started_embed.add_field(name="`/order`",value="**کامند اصلی بات جهت ثبت تبلیغات**",inline=False)
get_started_embed.add_field(name="`/transfer`",value="**جهت انتقال سکه به سایر کاربران**",inline=False)
get_started_embed.set_footer(text="موفق باشی 😉")




help_embed = Embed(title=f"Do you need help",
                       description="""**
                       دیسکواد یه بات تبلیغاتی توی دیسکورد هستش که میتونید با استفاده از اون سرور ، محصولات ، صفحات مجازی بنر تبلیغاتی و ... خود را به صورت کاملن رایگان تبلیغ کنید
                       این سیستم به شما کمک میکنه بتونید با تبلیغات گشترده ممبر ، مشتری ، ویو و ... جذب کنید.
                       به همین راحتی 😃
                       برای شروع کار میتونی از دکمه زیر استفاده کنی 👇**""",color=Colour.blurple())